# Определение базового образа с указанной версией Node.js
FROM node:18

# Установка рабочей директории в контейнере
WORKDIR /usr/src/app

# Копирование файлов `package.json` и `package-lock.json` (или `yarn.lock`)
COPY package*.json ./

# Установка зависимостей, включая dev зависимости для сборки TypeScript
RUN npm install

# Копирование исходного кода проекта в контейнер
COPY . .

# Сборка приложения
RUN npm run build

# Открытие порта, который будет использоваться приложением
EXPOSE 3000

# Запуск скомпилированного приложения
CMD ["node", "dist/main"]